{"payload":{"allShortcutsEnabled":true,"fileTree":{"models":{"items":[{"name":"deploy.prototxt","path":"models/deploy.prototxt","contentType":"file"},{"name":"gender_net.caffemodel","path":"models/gender_net.caffemodel","contentType":"file"}],"totalCount":2},"":{"items":[{"name":"face_parsing_PyTorch","path":"face_parsing_PyTorch","contentType":"directory"},{"name":"models","path":"models","contentType":"directory"},{"name":".gitignore","path":".gitignore","contentType":"file"},{"name":"README.md","path":"README.md","contentType":"file"},{"name":"face_gender_detection.py","path":"face_gender_detection.py","contentType":"file"},{"name":"face_segmentation.py","path":"face_segmentation.py","contentType":"file"},{"name":"main.py","path":"main.py","contentType":"file"},{"name":"requirements.txt","path":"requirements.txt","contentType":"file"},{"name":"setup_linux.sh","path":"setup_linux.sh","contentType":"file"},{"name":"setup_windows.bat","path":"setup_windows.bat","contentType":"file"},{"name":"tesnorrt_test.py","path":"tesnorrt_test.py","contentType":"file"},{"name":"webAPI.py","path":"webAPI.py","contentType":"file"},{"name":"webGUI.py","path":"webGUI.py","contentType":"file"}],"totalCount":13}},"fileTreeProcessingTime":8.925194,"foldersToFetch":[],"reducedMotionEnabled":"system","repo":{"id":636435498,"defaultBranch":"master","name":"FaceGenSeg","ownerLogin":"harrywenjie","currentUserCanPush":true,"isFork":false,"isEmpty":false,"createdAt":"2023-05-05T09:00:24.000+12:00","ownerAvatar":"https://avatars.githubusercontent.com/u/47763522?v=4","public":false,"private":true},"refInfo":{"name":"master","listCacheKey":"v0:1683427370.0","canEdit":true,"refType":"branch","currentOid":"285f32e1085f7b96eb4e4abb2bb91ba447e402a9"},"path":"models/deploy.prototxt","currentUser":{"id":47763522,"login":"harrywenjie","userEmail":"harrywenjie@gmail.com"},"blob":{"rawBlob":"name: \"CaffeNet\"\ninput: \"data\"\ninput_dim: 10\ninput_dim: 3\ninput_dim: 227\ninput_dim: 227\nlayers {\n  name: \"conv1\"\n  type: CONVOLUTION\n  bottom: \"data\"\n  top: \"conv1\"\n  convolution_param {\n    num_output: 96\n    kernel_size: 7\n    stride: 4\n  }\n}\nlayers {\n  name: \"relu1\"\n  type: RELU\n  bottom: \"conv1\"\n  top: \"conv1\"\n}\nlayers {\n  name: \"pool1\"\n  type: POOLING\n  bottom: \"conv1\"\n  top: \"pool1\"\n  pooling_param {\n    pool: MAX\n    kernel_size: 3\n    stride: 2\n  }\n}\nlayers {\n  name: \"norm1\"\n  type: LRN\n  bottom: \"pool1\"\n  top: \"norm1\"\n  lrn_param {\n    local_size: 5\n    alpha: 0.0001\n    beta: 0.75\n  }\n}\nlayers {\n  name: \"conv2\"\n  type: CONVOLUTION\n  bottom: \"norm1\"\n  top: \"conv2\"\n  convolution_param {\n    num_output: 256\n    pad: 2\n    kernel_size: 5\n  }\n}\nlayers {\n  name: \"relu2\"\n  type: RELU\n  bottom: \"conv2\"\n  top: \"conv2\"\n}\nlayers {\n  name: \"pool2\"\n  type: POOLING\n  bottom: \"conv2\"\n  top: \"pool2\"\n  pooling_param {\n    pool: MAX\n    kernel_size: 3\n    stride: 2\n  }\n}\nlayers {\n  name: \"norm2\"\n  type: LRN\n  bottom: \"pool2\"\n  top: \"norm2\"\n  lrn_param {\n    local_size: 5\n    alpha: 0.0001\n    beta: 0.75\n  }\n}\nlayers {\n  name: \"conv3\"\n  type: CONVOLUTION\n  bottom: \"norm2\"\n  top: \"conv3\"\n  convolution_param {\n    num_output: 384\n    pad: 1\n    kernel_size: 3\n  }\n}\nlayers{\n  name: \"relu3\" \n  type: RELU\n  bottom: \"conv3\"\n  top: \"conv3\"\n}\nlayers {\n  name: \"pool5\"\n  type: POOLING\n  bottom: \"conv3\"\n  top: \"pool5\"\n  pooling_param {\n    pool: MAX\n    kernel_size: 3\n    stride: 2\n  }\n}\nlayers {\n  name: \"fc6\"\n  type: INNER_PRODUCT\n  bottom: \"pool5\"\n  top: \"fc6\"\n  inner_product_param {\n    num_output: 512\n  }\n}\nlayers {\n  name: \"relu6\"\n  type: RELU\n  bottom: \"fc6\"\n  top: \"fc6\"\n}\nlayers {\n  name: \"drop6\"\n  type: DROPOUT\n  bottom: \"fc6\"\n  top: \"fc6\"\n  dropout_param {\n    dropout_ratio: 0.5\n  }\n}\nlayers {\n  name: \"fc7\"\n  type: INNER_PRODUCT\n  bottom: \"fc6\"\n  top: \"fc7\"\n  inner_product_param {\n    num_output: 512\n  }\n}\nlayers {\n  name: \"relu7\"\n  type: RELU\n  bottom: \"fc7\"\n  top: \"fc7\"\n}\nlayers {\n  name: \"drop7\"\n  type: DROPOUT\n  bottom: \"fc7\"\n  top: \"fc7\"\n  dropout_param {\n    dropout_ratio: 0.5\n  }\n}\nlayers {\n  name: \"fc8\"\n  type: INNER_PRODUCT\n  bottom: \"fc7\"\n  top: \"fc8\"\n  inner_product_param {\n    num_output: 2\n  }\n}\nlayers {\n  name: \"prob\"\n  type: SOFTMAX\n  bottom: \"fc8\"\n  top: \"prob\"\n}\n","colorizedLines":["name: &quot;CaffeNet&quot;","input: &quot;data&quot;","input_dim: 10","input_dim: 3","input_dim: 227","input_dim: 227","layers {","  name: &quot;conv1&quot;","  type: CONVOLUTION","  bottom: &quot;data&quot;","  top: &quot;conv1&quot;","  convolution_param {","    num_output: 96","    kernel_size: 7","    stride: 4","  }","}","layers {","  name: &quot;relu1&quot;","  type: RELU","  bottom: &quot;conv1&quot;","  top: &quot;conv1&quot;","}","layers {","  name: &quot;pool1&quot;","  type: POOLING","  bottom: &quot;conv1&quot;","  top: &quot;pool1&quot;","  pooling_param {","    pool: MAX","    kernel_size: 3","    stride: 2","  }","}","layers {","  name: &quot;norm1&quot;","  type: LRN","  bottom: &quot;pool1&quot;","  top: &quot;norm1&quot;","  lrn_param {","    local_size: 5","    alpha: 0.0001","    beta: 0.75","  }","}","layers {","  name: &quot;conv2&quot;","  type: CONVOLUTION","  bottom: &quot;norm1&quot;","  top: &quot;conv2&quot;","  convolution_param {","    num_output: 256","    pad: 2","    kernel_size: 5","  }","}","layers {","  name: &quot;relu2&quot;","  type: RELU","  bottom: &quot;conv2&quot;","  top: &quot;conv2&quot;","}","layers {","  name: &quot;pool2&quot;","  type: POOLING","  bottom: &quot;conv2&quot;","  top: &quot;pool2&quot;","  pooling_param {","    pool: MAX","    kernel_size: 3","    stride: 2","  }","}","layers {","  name: &quot;norm2&quot;","  type: LRN","  bottom: &quot;pool2&quot;","  top: &quot;norm2&quot;","  lrn_param {","    local_size: 5","    alpha: 0.0001","    beta: 0.75","  }","}","layers {","  name: &quot;conv3&quot;","  type: CONVOLUTION","  bottom: &quot;norm2&quot;","  top: &quot;conv3&quot;","  convolution_param {","    num_output: 384","    pad: 1","    kernel_size: 3","  }","}","layers{","  name: &quot;relu3&quot; ","  type: RELU","  bottom: &quot;conv3&quot;","  top: &quot;conv3&quot;","}","layers {","  name: &quot;pool5&quot;","  type: POOLING","  bottom: &quot;conv3&quot;","  top: &quot;pool5&quot;","  pooling_param {","    pool: MAX","    kernel_size: 3","    stride: 2","  }","}","layers {","  name: &quot;fc6&quot;","  type: INNER_PRODUCT","  bottom: &quot;pool5&quot;","  top: &quot;fc6&quot;","  inner_product_param {","    num_output: 512","  }","}","layers {","  name: &quot;relu6&quot;","  type: RELU","  bottom: &quot;fc6&quot;","  top: &quot;fc6&quot;","}","layers {","  name: &quot;drop6&quot;","  type: DROPOUT","  bottom: &quot;fc6&quot;","  top: &quot;fc6&quot;","  dropout_param {","    dropout_ratio: 0.5","  }","}","layers {","  name: &quot;fc7&quot;","  type: INNER_PRODUCT","  bottom: &quot;fc6&quot;","  top: &quot;fc7&quot;","  inner_product_param {","    num_output: 512","  }","}","layers {","  name: &quot;relu7&quot;","  type: RELU","  bottom: &quot;fc7&quot;","  top: &quot;fc7&quot;","}","layers {","  name: &quot;drop7&quot;","  type: DROPOUT","  bottom: &quot;fc7&quot;","  top: &quot;fc7&quot;","  dropout_param {","    dropout_ratio: 0.5","  }","}","layers {","  name: &quot;fc8&quot;","  type: INNER_PRODUCT","  bottom: &quot;fc7&quot;","  top: &quot;fc8&quot;","  inner_product_param {","    num_output: 2","  }","}","layers {","  name: &quot;prob&quot;","  type: SOFTMAX","  bottom: &quot;fc8&quot;","  top: &quot;prob&quot;","}"],"stylingDirectives":null,"csv":null,"csvError":null,"dependabotInfo":{"showConfigurationBanner":null,"configFilePath":null,"networkDependabotPath":"/harrywenjie/FaceGenSeg/network/updates","dismissConfigurationNoticePath":"/settings/dismiss-notice/dependabot_configuration_notice","configurationNoticeDismissed":false,"repoAlertsPath":"/harrywenjie/FaceGenSeg/security/dependabot","repoSecurityAndAnalysisPath":"/harrywenjie/FaceGenSeg/settings/security_analysis","repoOwnerIsOrg":false,"currentUserCanAdminRepo":true},"displayName":"deploy.prototxt","displayUrl":"https://github.com/harrywenjie/FaceGenSeg/blob/master/models/deploy.prototxt?raw=true","headerInfo":{"blobSize":"2.25 KB","deleteInfo":{"deletePath":"https://github.com/harrywenjie/FaceGenSeg/delete/master/models/deploy.prototxt","deleteTooltip":"Delete this file"},"editInfo":{"editTooltip":"Edit this file"},"ghDesktopPath":"x-github-client://openRepo/https://github.com/harrywenjie/FaceGenSeg?branch=master&filepath=models%2Fdeploy.prototxt","gitLfsPath":null,"onBranch":true,"shortPath":"a0f7cb8","siteNavLoginPath":"/login?return_to=https%3A%2F%2Fgithub.com%2Fharrywenjie%2FFaceGenSeg%2Fblob%2Fmaster%2Fmodels%2Fdeploy.prototxt","isCSV":false,"isRichtext":false,"toc":null,"lineInfo":{"truncatedLoc":"175","truncatedSloc":"175"},"mode":"file"},"image":false,"isCodeownersFile":null,"isValidLegacyIssueTemplate":false,"issueTemplateHelpUrl":"https://docs.github.com/articles/about-issue-and-pull-request-templates","issueTemplate":null,"discussionTemplate":null,"language":null,"large":false,"loggedIn":true,"newDiscussionPath":"/harrywenjie/FaceGenSeg/discussions/new","newIssuePath":"/harrywenjie/FaceGenSeg/issues/new","planSupportInfo":{"repoIsFork":null,"repoOwnedByCurrentUser":null,"requestFullPath":"/harrywenjie/FaceGenSeg/blob/master/models/deploy.prototxt","showFreeOrgGatedFeatureMessage":null,"showPlanSupportBanner":null,"upgradeDataAttributes":null,"upgradePath":null},"publishBannersInfo":{"dismissActionNoticePath":"/settings/dismiss-notice/publish_action_from_dockerfile","dismissStackNoticePath":"/settings/dismiss-notice/publish_stack_from_file","releasePath":"/harrywenjie/FaceGenSeg/releases/new?marketplace=true","showPublishActionBanner":false,"showPublishStackBanner":false},"renderImageOrRaw":false,"richText":null,"renderedFileInfo":null,"tabSize":8,"topBannersInfo":{"overridingGlobalFundingFile":false,"globalPreferredFundingPath":null,"repoOwner":"harrywenjie","repoName":"FaceGenSeg","showInvalidCitationWarning":false,"citationHelpUrl":"https://docs.github.com/en/github/creating-cloning-and-archiving-repositories/creating-a-repository-on-github/about-citation-files","showDependabotConfigurationBanner":null,"actionsOnboardingTip":null},"truncated":false,"viewable":true,"workflowRedirectUrl":null,"symbols":{"timedOut":false,"notAnalyzed":false,"symbols":[]}},"csrf_tokens":{"/harrywenjie/FaceGenSeg/branches":{"post":"aa4sCGho7alxwxK10bGrRI2W21LuEzWkbVtFogX3fXPHYc872rbMXnb0Qu1a_OANKCPhON-PH6s_LI_hBQD2Yw"}}},"title":"FaceGenSeg/deploy.prototxt at master · harrywenjie/FaceGenSeg","locale":"en"}